nxp-mcuxpresso/mcuxsdk-examples/_boards/frdmmcxl255/cmsis_driver_examples/lpspi/edma_b2b_transfer/master/pin_mux.c
/*
 * Copyright 2026 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: Pins v17.0
processor: MCXL255
package_id: MCXL255VDF
mcu_data: ksdk2_0
processor_version: 0.2603.90
pin_labels:
- {pin_num: P2, pin_signal: P2_10/FREQME_CLK_IN0/LPUART0_RXD/LPSPI0_PCS1/LPUART1_RXD/TRIG_OUT0/CT1_MAT0/SLCD_25/WUU_P15, label: 'LPUART0_RXD/JP16[1]', identifier: LPUART0_RXD}
- {pin_num: P3, pin_signal: P2_11/FREQME_CLK_IN1/LPUART0_TXD/LPSPI0_SDO/LPUART1_TXD/TRIG_OUT1/CT1_MAT1/SLCD_26, label: 'LPUART0_TXD/JP19[1]', identifier: LPUART0_TXD}
- {pin_num: D2, pin_signal: P1_17/TRIG_IN0/LPI2C1_HREQ/LPSPI1_SDO/TRIG_OUT0/ACMP0_OUT/SLCD_11/WUU_P7, label: 'P1_17/J2[8]', identifier: LPSPI1_SDO}
- {pin_num: D1, pin_signal: P1_18/TRIG_IN1/LPI2C1_SCL/LPSPI1_SCK/TRIG_OUT1/CT0_MAT0/SLCD_12, label: 'P1_18/J2[12]/J3[13]', identifier: LPSPI1_SCK}
- {pin_num: F3, pin_signal: P1_19/TRIG_IN2/LPI2C1_SDA/LPSPI1_SDI/TRIG_OUT2/CT0_MAT1/SLCD_13/WUU_P9, label: 'P1_19/J2[10]/J3[15]', identifier: LPSPI1_SDI}
- {pin_num: F1, pin_signal: P1_20/TRIG_IN3/LPUART1_RXD/LPSPI1_PCS0/TRIG_OUT3/CT0_MAT2/SLCD_14/WUU_P10, label: 'P1_20/J2[6]', identifier: LPSPI1_PCS0}
- {pin_num: H2, pin_signal: P2_0/FREQME_CLK_IN0/LPUART0_RXD/LPSPI0_SDO/TRIG_IN13/CT1_MAT0/SLCD_17/WUU_P11/HSADC0_A16, label: 'P2_0/J2[3]/J4[9]', identifier: LPSPI0_SDO}
- {pin_num: H1, pin_signal: P2_1/FREQME_CLK_IN1/LPUART0_TXD/LPSPI0_SCK/TRIG_IN14/CT1_MAT1/SLCD_18/HSADC0_A15, label: 'P2_1/J1[3]/J2[5]', identifier: LPSPI0_SCK}
- {pin_num: H3, pin_signal: P2_2/TRIG_IN6/LPUART0_RTS_B/LPSPI0_SDI/LPI2C1_SCLS/TRIG_OUT6/CT1_MAT2/SLCD_19/HSADC0_A14, label: 'P2_2/J2[15]/J4[1]', identifier: LPSPI0_SDI}
- {pin_num: J3, pin_signal: P2_3/TRIG_IN7/LPUART0_CTS_B/LPSPI0_PCS0/LPI2C1_SDAS/TRIG_OUT6/CT1_MAT3/SLCD_20/WUU_P12/HSADC0_A13, label: 'P2_3/J2[17]/J4[3]', identifier: LPSPI0_PCS0}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

#include "fsl_common.h"
#include "fsl_port.h"
#include "pin_mux.h"

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitBootPins
 * Description   : Calls initialization functions.
 *
 * END ****************************************************************************************************************/
void BOARD_InitBootPins(void)
{
    BOARD_InitDEBUG_UARTPins();
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitDEBUG_UARTPins:
- options: {callFromInitBoot: 'true', coreID: cm33, enableClock: 'true', fullInit: 'true'}
- pin_list:
  - {pin_num: P2, peripheral: LPUART0, signal: RX, pin_signal: P2_10/FREQME_CLK_IN0/LPUART0_RXD/LPSPI0_PCS1/LPUART1_RXD/TRIG_OUT0/CT1_MAT0/SLCD_25/WUU_P15, identifier: '',
    slew_rate: fast, open_drain: disable, drive_strength: low, pull_select: down, pull_enable: disable, input_buffer: enable, invert_input: normal}
  - {pin_num: P3, peripheral: LPUART0, signal: TX, pin_signal: P2_11/FREQME_CLK_IN1/LPUART0_TXD/LPSPI0_SDO/LPUART1_TXD/TRIG_OUT1/CT1_MAT1/SLCD_26, identifier: '',
    slew_rate: fast, open_drain: disable, drive_strength: low, pull_select: down, pull_enable: disable, input_buffer: enable, invert_input: normal}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitDEBUG_UARTPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitDEBUG_UARTPins(void)
{
    /* Clock gate control PORT2: Peripheral clock is enabled */
    CLOCK_EnableClock(kCLOCK_GatePORT2);
    /* LPUART0 peripheral is released from reset */
    RESET_ReleasePeripheralReset(kLPUART0_RST_SHIFT_RSTn);
    /* PORT2 peripheral is released from reset */
    RESET_ReleasePeripheralReset(kPORT2_RST_SHIFT_RSTn);

    const port_pin_config_t port2_10_pinP2_config = {/* Internal pull-up/down resistor is disabled */
                                                     kPORT_PullDisable,
                                                     /* Low internal pull resistor value is selected. */
                                                     kPORT_LowPullResistor,
                                                     /* Fast slew rate is configured */
                                                     kPORT_FastSlewRate,
                                                     /* Passive input filter is disabled */
                                                     kPORT_PassiveFilterDisable,
                                                     /* Open drain output is disabled */
                                                     kPORT_OpenDrainDisable,
                                                     /* Low drive strength is configured */
                                                     kPORT_LowDriveStrength,
                                                     /* Normal drive strength is configured */
                                                     kPORT_NormalDriveStrength,
                                                     /* Pin is configured as LPUART0_RXD */
                                                     kPORT_MuxAlt2,
                                                     /* Digital input enabled */
                                                     kPORT_InputBufferEnable,
                                                     /* Digital input is not inverted */
                                                     kPORT_InputNormal,
                                                     /* Pin Control Register fields [15:0] are not locked */
                                                     kPORT_UnlockRegister};
    /* PORT2_10 (pin P2) is configured as LPUART0_RXD */
    PORT_SetPinConfig(PORT2, 10U, &port2_10_pinP2_config);

    const port_pin_config_t port2_11_pinP3_config = {/* Internal pull-up/down resistor is disabled */
                                                     kPORT_PullDisable,
                                                     /* Low internal pull resistor value is selected. */
                                                     kPORT_LowPullResistor,
                                                     /* Fast slew rate is configured */
                                                     kPORT_FastSlewRate,
                                                     /* Passive input filter is disabled */
                                                     kPORT_PassiveFilterDisable,
                                                     /* Open drain output is disabled */
                                                     kPORT_OpenDrainDisable,
                                                     /* Low drive strength is configured */
                                                     kPORT_LowDriveStrength,
                                                     /* Normal drive strength is configured */
                                                     kPORT_NormalDriveStrength,
                                                     /* Pin is configured as LPUART0_TXD */
                                                     kPORT_MuxAlt2,
                                                     /* Digital input enabled */
                                                     kPORT_InputBufferEnable,
                                                     /* Digital input is not inverted */
                                                     kPORT_InputNormal,
                                                     /* Pin Control Register fields [15:0] are not locked */
                                                     kPORT_UnlockRegister};
    /* PORT2_11 (pin P3) is configured as LPUART0_TXD */
    PORT_SetPinConfig(PORT2, 11U, &port2_11_pinP3_config);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitSPIPins:
- options: {callFromInitBoot: 'false', coreID: cm33, enableClock: 'true', fullInit: 'true'}
- pin_list:
  - {pin_num: H2, peripheral: LPSPI0, signal: OUT, pin_signal: P2_0/FREQME_CLK_IN0/LPUART0_RXD/LPSPI0_SDO/TRIG_IN13/CT1_MAT0/SLCD_17/WUU_P11/HSADC0_A16, identifier: '',
    slew_rate: fast, open_drain: disable, drive_strength: low, pull_select: down, pull_enable: disable, input_buffer: enable, invert_input: normal}
  - {pin_num: H1, peripheral: LPSPI0, signal: SCK, pin_signal: P2_1/FREQME_CLK_IN1/LPUART0_TXD/LPSPI0_SCK/TRIG_IN14/CT1_MAT1/SLCD_18/HSADC0_A15, identifier: '', slew_rate: fast,
    open_drain: disable, drive_strength: low, pull_select: down, pull_enable: disable, input_buffer: enable, invert_input: normal}
  - {pin_num: H3, peripheral: LPSPI0, signal: IN, pin_signal: P2_2/TRIG_IN6/LPUART0_RTS_B/LPSPI0_SDI/LPI2C1_SCLS/TRIG_OUT6/CT1_MAT2/SLCD_19/HSADC0_A14, identifier: '',
    slew_rate: fast, open_drain: disable, drive_strength: low, pull_select: down, pull_enable: disable, input_buffer: enable, invert_input: normal}
  - {pin_num: J3, peripheral: LPSPI0, signal: PCS0, pin_signal: P2_3/TRIG_IN7/LPUART0_CTS_B/LPSPI0_PCS0/LPI2C1_SDAS/TRIG_OUT6/CT1_MAT3/SLCD_20/WUU_P12/HSADC0_A13,
    identifier: '', slew_rate: fast, open_drain: disable, drive_strength: low, pull_select: down, pull_enable: disable, input_buffer: enable, invert_input: normal}
  - {pin_num: D2, peripheral: LPSPI1, signal: OUT, pin_signal: P1_17/TRIG_IN0/LPI2C1_HREQ/LPSPI1_SDO/TRIG_OUT0/ACMP0_OUT/SLCD_11/WUU_P7, identifier: '', slew_rate: fast,
    open_drain: disable, drive_strength: low, pull_select: down, pull_enable: disable, input_buffer: enable, invert_input: normal}
  - {pin_num: D1, peripheral: LPSPI1, signal: SCK, pin_signal: P1_18/TRIG_IN1/LPI2C1_SCL/LPSPI1_SCK/TRIG_OUT1/CT0_MAT0/SLCD_12, identifier: '', slew_rate: fast, open_drain: disable,
    drive_strength: low, extra_drive_strength: normal, pull_select: down, pull_enable: disable, passive_filter: disable, pull_value: low, input_buffer: enable, invert_input: normal}
  - {pin_num: F3, peripheral: LPSPI1, signal: IN, pin_signal: P1_19/TRIG_IN2/LPI2C1_SDA/LPSPI1_SDI/TRIG_OUT2/CT0_MAT1/SLCD_13/WUU_P9, identifier: '', slew_rate: fast,
    open_drain: disable, drive_strength: low, extra_drive_strength: normal, pull_select: down, pull_enable: disable, passive_filter: disable, pull_value: low, input_buffer: enable,
    invert_input: normal}
  - {pin_num: F1, peripheral: LPSPI1, signal: PCS0, pin_signal: P1_20/TRIG_IN3/LPUART1_RXD/LPSPI1_PCS0/TRIG_OUT3/CT0_MAT2/SLCD_14/WUU_P10, identifier: '', slew_rate: fast,
    open_drain: disable, drive_strength: low, pull_select: down, pull_enable: disable, input_buffer: enable, invert_input: normal}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

